Repository: RPG-Maker-Translation-Tools/rpgmtranslate
Catalog: src-tauri/resources/locales/*/settings/messages.po
Languages: ru

source: (min 1, max 99)
ru: (мин. 1, макс. 99)

source: Allowed
ru: Разрешить

source: Ask for confirmation
ru: Подтверждение

source: Backup
ru: Резервное копирование

source: Check for updates
ru: Проверка обновлений

source: Create backup every:
ru: Создавать копии каждые:

source: Default
ru: По умолчанию

source: Disabled
ru: Выключить

source: Display lines breaks in text areas
ru: Отображать переносы строк в полях перевода

source: Font
ru: Шрифт

source: Max number of backups:
ru: Максимальное количество копии:

source: Row delete mode
ru: Режим удаления рядов

source: seconds (min 60, max 3600)
ru: секунд (мин. 60, макс. 3600)
