{"messages":{"/+Z5u4":["/+Z5u4"],"0W6vEJ":["Max Backups (1-99)"],"4NcKkU":["Ask for confirmation"],"5Cj9Ws":["Font"],"5bxxhI":["You need an API key from Anthropic. Check out <a class=\"text-third cursor-pointer hover:underline\">https://platform.claude.com/settings/keys</a> on how to get it."],"5saQN9":["Row Delete Mode"],"9Aw2fl":["You need an API key from Yandex. Check out <a class=\"text-third cursor-pointer hover:underline\">https://yandex.com/dev/dictionary/keys/get/</a> on how to get it."],"E/QGRL":["Disabled"],"E17Jpe":["Display lines breaks in text areas"],"Ewls/+":["Use glossary in the request. Very handy if you actually took your time to fill it, as it will make translation more consistent."],"ExibX3":["Validate Key"],"FHPe8O":["System Prompt"],"FbZXeo":["Temperature to use. Lower values produce more deterministic outputs, so it's advised to use something in range of 0.0-0.3. High values may be worse since they tune the model to be more 'creative'."],"GZ8oKi":["When writing system prompt, keep in mind that:"],"Hrhj0a":["Default System Prompt"],"KzmC5L":["Controls"],"LSPow/":["You need an API key from DeepSeek. Check out <a href=\"https://rahulranjan.org/2025/02/01/how-to-get-your-deepseek-api-key-testing-and-troubleshooting/\" class=\"text-third cursor-pointer hover:underline\">this foreign blog page</a> on how to get it."],"S3fkWh":["Translation is most likely to be better if you will empower AI with the great knowledge about the source material. If it's shitty JRPG with intentionally bad humor and some specific lore, include that in system prompt."],"SGsgDO":["Core"],"T38qYD":["You need an API key from Yandex. Check out <a href=\"https://yandex.com/dev/dictionary/keys/get/\" class=\"text-third cursor-pointer hover:underline\">here</a> on how to get it."],"WMCwmR":["Check for updates"],"Zin8TE":["You need an API key from DeepL. Check out <a class=\"text-third cursor-pointer hover:underline\">https://support.deepl.com/hc/en-us/articles/360020695820-API-key-for-DeepL-API</a> on how to get it."],"aAIQg2":["Appearance"],"aCD8g3":["Project Context"],"bcmdxR":["File Context"],"cYDOtx":["Select model to use. If model you want isn't in the list, you might need to allow it in provider's settings. For example, OpenAI does not allow using GPT-5 by default."],"cdalS7":["DeepSeek"],"dXlixB":["You need an API key from Google. Check out <a class=\"text-third cursor-pointer hover:underline\">https://ai.google.dev/gemini-api/docs/api-key</a> on how to get it."],"e0NrBM":["Project"],"e1f0gj":["Token limit for request. RPGMTranslate sends files to LLMs for translation in batches, and if summed tokens of the text in all those files exceed the limit, the rest of the files will be sent in a separate request. Very high limits are discouraged because AI might hallucinate/forget, and very low limits are discouraged because your tokens will burn. RPGMTranslate also uses OpenAI's tiktoken for tokenizing inputs, and it's hardcoded even for non-OpenAI models."],"eoe8BR":["Google"],"ewE9p/":["Yandex"],"f5g1K7":["OpenAI (ChatGPT)"],"foIBMu":["You need an API key from OpenAI. Check out <a href=\"https://www.merge.dev/blog/chatgpt-api-key\" class=\"text-third cursor-pointer hover:underline\">this foreign blog page</a> on how to get it."],"g5Y0Pi":["Translation Endpoint"],"joLIQz":["Allowed"],"kX4Hm4":["Failed to validate key."],"ki87Dm":["Custom font was not found. Ensure it's installed on your system."],"lirD5t":["System Prompt..."],"mI4X3Q":["Use thinking/reasoning, if available for the model. Translating with thinking most likely will use more tokens."],"n6lsTR":["Role:\nYou are a professional videogame localization expert and linguist. You translate game text with high fidelity, cultural awareness, consistency, and attention to gameplay context, UI constraints, and narrative tone.\n\nAction:\nTranslate all provided strings from sourceLanguage to translationLanguage. Use all available context to produce natural, player-facing translations suitable for a shipped videogame.\n\nContext:\nYou will receive a JSON object containing files, blocks, and strings.\nEach Block represents a logical unit of text.\nText belongs to a JRPG/RPG/Visual Novel game, made with RPG Maker.\nUse these context signals aggressively:\n\n* name: Treat this as critical semantic context. It often describes what the block or filename refers to (location/setting).\n* filename: Indicates file purpose (map, system, items, etc.).\n* before_strings / after_strings: Provide neighboring context; use them to resolve ambiguity but do not translate them.\n* glossary: Mandatory terminology. Always prefer glossary translations and respect notes.\n* project_context and local_context: High-level and situational guidance; use them to maintain tone, register, and lore consistency.\n  Special case - map files:\n* Strings may contain a line like <!-- EVENT NAME -->.\n* This line marks the start of a new event and possibly a new context.\n* Do not translate the marker itself.\n* Use the event name and the block name to re-evaluate context for the following strings.\n\nGeneral rules:\n\n* Preserve meaning, intent, emotional tone, and gameplay function.\n* Prefer concise, idiomatic translations suitable for UI and dialog.\n* Keep placeholders, variables, tags, markup, and control codes unchanged.\n* Maintain consistency across files and blocks.\n* Do not add explanations, comments, or extra text.\n\nExecute:\nProcess each file, then each block inside it, and translate only the strings array.\nReturn ONLY a JSON object in the following exact structure:\n\n```json\n{\n    \"filename\": {\n        \"id\": {\n            \"strings\": [...]\n        }\n    }\n}\n```\n\nNo additional keys, no reordered structure, no commentary."],"nrZZkA":["You need an API key from OpenAI. Check out <a class=\"text-third cursor-pointer hover:underline\">https://platform.openai.com/api-keys</a> on how to get it."],"o9JUQr":["You need an API key from Anthropic. Check out <a href=\"https://www.merge.dev/blog/anthropic-api-key\" class=\"text-third cursor-pointer hover:underline\">this foreign blog page</a> on how to get it."],"ovBPCi":["Default"],"r6vjLR":["Row Length Hint"],"rLgPvm":["Backup"],"rg9Ypn":["You can advise AI to use delimiter comments like ID, because most likely that means a new text source and a new content."],"s31qZE":["Anthropic (Claude)"],"ue+wa6":["You also need a folder ID from Yandex. You can find it in the same link."],"v7tgCc":["AI receives source and translaton languages as BCP-47 tags."],"vuj5O3":["AI response must be an array of strings in the same order as input."],"wFcvZJ":["Translation"],"zQqqbH":["If you have glossary enabled, advise AI to use it, because otherwise it won't."],"zjluQl":["Backup Interval (secs, 60-3600)"],"zmBc+6":["You need an API key from DeepSeek. Check out <a class=\"text-third cursor-pointer hover:underline\">https://platform.deepseek.com/api_keys</a> on how to get it."]}}