Repository: RPG-Maker-Translation-Tools/rpgmtranslate
Catalog: src-tauri/resources/locales/*/main/messages.po
Languages: ru

source: -Select Action-
ru: -Выберите действие-

source: -Select Column-
ru: -Выберите столбец-

source: -Select File-
ru: -Выберите файл-

source: <div id="no-results" class="content-center h-full">No matches</div>
ru: <div id="no-results" class="content-center h-full">Нет совпадений</div>

source: About
ru: О программе

source: All files were written successfully. Elapsed: {executionTime}
ru: Все файлы были успешно записаны. Затрачено: {executionTime}

source: Allow duplicates
ru: Разрешить дубликаты

source: Append
ru: Добавление

source: Appends any new text from the game to the translation files, if the text is not already present. Unused lines are removed from translation files, and the lines order is sorted.
ru: Добавляет новый текст из игры в файлы перевода, если этого текста ещё не существует. Неиспользуемые строки будут удалены из перевода, а порядок строк будет отсортирован.

source: Apply
ru: Применить

source: Batch menu
ru: Меню обработки

source: Bookmarks (Ctrl + B)
ru: Закладки (Ctrl + B)

source: Can't found row with {logSource} source text in file {filename} and entry {entry}.
ru: Не удалось найти ряд с исходным текстом {logSource} в файле {filename} и записи {entry}.

source: Cancel
ru: Отмена

source: Cannot determine the type of the game's engine.
ru: Не удалось определить тип движка игры.

source: Consider case (Alt + C)
ru: Учитывать регистр (Alt + C)

source: Create .rvpacker-ignore file from purged lines to prevent their further appearance
ru: Создать файл .rvpacker-ignore из удалённых строк, чтобы избежать их повторного появления в файлах

source: Create theme
ru: Создать тему

source: Create Theme
ru: Создать тему

source: Dark background color
ru: Тёмный цвет фона

source: Deleting is disabled in settings.
ru: Удаление рядов выключено в настройках.

source: Deselect All
ru: Убрать всё

source: Disable Actors, Armors, Troops etc. processing
ru: Выключить обработку файлов Actors, Armors, Troops...

source: Disable Mapxxx processing
ru: Выключить обработку файлов Mapxxx

source: Disable plugins.js/Scripts processing
ru: Выключить обработку файла plugins.js/Scripts

source: Disable System processing
ru: Выключить обработку файла System

source: Disables built-in custom processing, implemented for some games. Right now, implemented for the following titles: LISA: The Painful and its derivatives, Fear & Hunger 2: Termina. Will be automatically set if it was used in read
ru: Выключает встроенную индивидуальную обработку, имплементированную для некоторых игр. Прямо сейчас, имплементирована для: "LISA: The Painful" и игр на основе, "Fear & Hunger 2: Termina".

source: Do you really want to delete this row? This action is irreversible!
ru: Вы действительно хотите удалить этот ряд? Это действие необратимо!

source: File
ru: Файл

source: Focus border color
ru: Цвет границы при наводке

source: Focused outline color
ru: Цвет обводки при наводке

source: Force rewrite
ru: Перезаписать

source: Force rewrites existing translation files.
ru: Принудительно переписывает существующие файлы перевода.

source: Game files do not exist (no original/data/Data directory), so it's only possible to edit and save translation.
ru: Файлы игры не существуют (нет директории original/data/Data), так что возможно лишь редактировать и сохранять перевод.

source: Go to row... from 1 to {lastRowNumber}
ru: Перейти на ряд... от 1 до {lastRowNumber}

source: Help
ru: Помощь

source: How to handle duplicates in text.
ru: Как поступить с дубликатами в тексте.

source: How to read files.
ru: Как читать файлы.

source: If you parsing text from a Japanese game, that contains symbols like 「」, which are just the Japanese quotation marks, it automatically replaces these symbols by their western equivalents (in this case, '').
ru: Если вы парсите текст из японской игры, который содержит символы вроде 「」, которые просто являются японскими кавычками, они автоматически будут заменены на их западные эквиваленты (в этом случае, '').

source: Ignore entries from .rvpacker-ignore file
ru: Игнорировать строки из файла .rvpacker-ignore

source: Invalid theme name: Allowed characters: a-z, A-Z, 0-9, -, _.
ru: Неверное название темы: Разрешённые символы: a-z, A-Z, 0-9, -, _.

source: Language
ru: Язык

source: Language tag is invalid. You must use existing IANA BCP-47 language tag. For example, en-US or ja-JP
ru: Неверный языковой тег. Вы должны использовать существующий тег IANA BCP-47. Например, en-US или ja-JP

source: Line length for wrapping
ru: Длина строки для переноса

source: Loading project
ru: Загрузка проекта

source: No project selected. Select the project directory, using 'open folder' button in the left-top corner.
ru: Проект не выбран. Выберите директорию проекта, используя кнопку "открыть папку" в левом верхнем углу.

source: of
ru: из

source: Open directory
ru: Открыть директорию

source: Primary background color
ru: Основной цвет фона

source: Primary border color
ru: Основной цвет границы

source: Primary hovered background color
ru: Основной цвет фона при наводке

source: Primary outline color
ru: Основной цвет обводки

source: Primary text color
ru: Основной цвет текста

source: Purge
ru: Чистка

source: Purge menu
ru: Меню чистки

source: Put text to translation textarea of matching source text
ru: Заместить текст в поле перевода, если текст в поле исходного текста совпадает с искомым.

source: Quit without saving?
ru: Выйти без сохранения?

source: Read
ru: Чтение

source: Read menu
ru: Меню чтения

source: Reload (F5)
ru: Перезагрузка (F5)

source: Remove duplicates
ru: Удалить дубликаты

source: Removes the leading and trailing whitespace from extracted strings. Don't use this option unless you know that trimming the text won't cause any incorrect behavior
ru: Удаляет лишние начальные и конечные пробелы из текста. Не используйте эту опцию, если не уверены, что удаление лишних пробелов не вызовет никаких проблем

source: Replace all matches
ru: Заменить все совпадения

source: Replace input
ru: Ввод замены

source: Rightmost filled
ru: Крайний заполненный

source: Row
ru: Ряд

source: Save (Ctrl + S)
ru: Сохранение (Ctrl + S)

source: Search
ru: Поиск

source: Search (Ctrl + F)
ru: Поиск (Ctrl + F)

source: Search by regular expressions (Alt + R)
ru: Поиск по регулярным выражениям (Alt + R)

source: Search everywhere
ru: Искать везде

source: Search input
ru: Ввод поиска

source: Search mode
ru: Режим поиска

source: Search only in current tab (Alt + L)
ru: Поиск только в текущем файле (Alt + L)

source: Search only in source text
ru: Искать только в исходном тексте

source: Search only in translation
ru: Искать только в переводе

source: Search the whole text (Alt + W)
ru: Искать текст целиком (Alt + W)

source: Second background color
ru: Вторичный цвет фона

source: Second border color
ru: Вторичный цвет границы

source: Second hovered background color
ru: Вторичный цвет фона при наводке

source: Second outline color
ru: Вторичный текст обводки

source: Second text color
ru: Вторичный цвет текста

source: Select All
ru: Выбрать всё

source: Select column
ru: Выберите столбец

source: Select files (You can hold LMB and drag to select multiple files)
ru: Выберите файлы (можно зажать ЛКМ и выделить несколько файлов)

source: Select Output Path
ru: Выбрать выходной путь

source: Selected directory does not contain original/data/Data directory, .rgss archive or translation directory. Project won't be initialized.
ru: Выбранная директория не содержит директории origina/data/Data, архива .rgss или директории translation. Проект не будет инициализирован.

source: Selected directory is already opened in the program.
ru: Выбранная директория уже открыта в программе.

source: Selected directory is missing. Project won't be initialized.
ru: Выбранная директория отсутствует. Проект не будет инициализирован.

source: Settings
ru: Настройки

source: Source
ru: Исходник

source: Source text cannot be replaced.
ru: Исходный текст нельзя заменить.

source: Source text language for machine translation (e. g. en-US, ru-RU)
ru: Исходный язык для машинного перевода (e. g. en-US, ru-RU)

source: Tabs (Tab)
ru: Вкладки (Tab)

source: Text was reverted to the previous state
ru: Текст был возвращён в прошлое состояние

source: Theme name. Allowed characters: a-z, A-Z, 0-9, -, _.
ru: Название темы. Разрешённые символы: a-z, A-Z, 0-9, -, _.

source: Themes
ru: Темы

source: Third background color
ru: Третичный цвет фона

source: Third outline color
ru: Третичный цвет обводки

source: Third text color
ru: Третичный цвет текста

source: Translate
ru: Перевод

source: Translation
ru: Перевод

source: Translation language for machine translation (e. g. en-US, ru-RU)
ru: Язык перевода для машинного перевода (e. g. en-US, ru-RU)

source: Translation languages are not set. Input them to the fields above.
ru: Языки перевода не установлены. Введите их в поля сверху.

source: Trim
ru: Удаление пробелов

source: Wrap
ru: Перенос строк

source: Write (Alt + C)
ru: Запись (Alt + C)

source: You have unsaved changes. Save progress and quit?
ru: У вас остались несохранённые изменения. Сохранить прогресс и выйти?
